In [1]:
# github.com/echtr

In [2]:
import numpy as np
import pandas as pd

In [3]:
# önceki dersin daha detaylısı, birebir birleştirme

In [5]:
df1 = pd.DataFrame(
    {"calisanlar": ["Ali","Veli","Mehmet"],
    "bolum": ["Muhasebe", "İK", "Muhasebe"]}
)
df1

  calisanlar     bolum
0        Ali  Muhasebe
1       Veli        İK
2     Mehmet  Muhasebe

In [6]:
df2 = pd.DataFrame({
    "calisanlar":["Ali","Veli","Mehmet"],
    "ilk_giris":[2010, 2015, 2020] 
})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2015
2     Mehmet       2020

In [8]:
pd.merge(df1, df2) # dataframelerde hangi değişkene göre birleştirme yapılacağını anlıyor ve ona göre birleştiriyor

  calisanlar     bolum  ilk_giris
0        Ali  Muhasebe       2010
1       Veli        İK       2015
2     Mehmet  Muhasebe       2020

In [9]:
pd.merge(df1, df2, on = "calisanlar") # fakat biz bunu ayriyetten belirtebiliriz

  calisanlar     bolum  ilk_giris
0        Ali  Muhasebe       2010
1       Veli        İK       2015
2     Mehmet  Muhasebe       2020

In [11]:
df3 = pd.merge(df1, df2)
df3

  calisanlar     bolum  ilk_giris
0        Ali  Muhasebe       2010
1       Veli        İK       2015
2     Mehmet  Muhasebe       2020

In [15]:
df4 = pd.DataFrame({
    "bolum":["Muhasebe", "İK"],
    "mudur": ["Mehmet","Ayşe"]
})
df4

      bolum   mudur
0  Muhasebe  Mehmet
1        İK    Ayşe

In [17]:
pd.merge(df3, df4) # bu fonksiyon gerçekten çok şaşırtıcı

  calisanlar     bolum  ilk_giris   mudur
0        Ali  Muhasebe       2010  Mehmet
1     Mehmet  Muhasebe       2020  Mehmet
2       Veli        İK       2015    Ayşe

In [18]:
df5 = pd.DataFrame({
    "bolum":["Muhasebe","İK","Muhasebe"],
    "yetenekler":["Hesap","İnsan İlişkileri","Kitap"]
})
df5

      bolum        yetenekler
0  Muhasebe             Hesap
1        İK  İnsan İlişkileri
2  Muhasebe             Kitap

In [19]:
pd.merge(df1, df5) # bütün değerleri oturtabilmek için çokluyor

  calisanlar     bolum        yetenekler
0        Ali  Muhasebe             Hesap
1        Ali  Muhasebe             Kitap
2     Mehmet  Muhasebe             Hesap
3     Mehmet  Muhasebe             Kitap
4       Veli        İK  İnsan İlişkileri